RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_can.c
/*******************************************************************************
* Function Name  : CAN_OperatingModeRequest
* Description    : Select the CAN Operation mode.
* Input          : CANx: where x can be 1 to select the CAN peripheral.
*                  CAN_OperatingMode : CAN Operating Mode.
*                    CAN_OperatingMode_Initialization.
*                    CAN_OperatingMode_Normal.
*                    CAN_OperatingMode_Sleep.
* Return         : status: 
*                    CAN_ModeStatus_Failed: CAN failed entering the specific mode. 
*                    CAN_ModeStatus_Success: CAN Succeed entering the specific mode. 
*******************************************************************************/
uint8_t CAN_OperatingModeRequest(CAN_TypeDef* CANx, uint8_t CAN_OperatingMode)
{
  uint8_t status = CAN_ModeStatus_Failed;
  uint32_t timeout = INAK_TIMEOUT; 

  if (CAN_OperatingMode == CAN_OperatingMode_Initialization)
  {
    CANx->CTLR = (uint32_t)((CANx->CTLR & (uint32_t)(~(uint32_t)CAN_CTLR_SLEEP)) | CAN_CTLR_INRQ);

    while (((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_INAK) && (timeout != 0))
    {
      timeout--;
    }
    if ((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_INAK)
    {
      status = CAN_ModeStatus_Failed;
    }
    else
    {
      status = CAN_ModeStatus_Success;
    }
  }
  else if (CAN_OperatingMode == CAN_OperatingMode_Normal)
  {
    CANx->CTLR &= (uint32_t)(~(CAN_CTLR_SLEEP|CAN_CTLR_INRQ));

    while (((CANx->STATR & CAN_MODE_MASK) != 0) && (timeout!=0))
    {
      timeout--;
    }
    if ((CANx->STATR & CAN_MODE_MASK) != 0)
    {
      status = CAN_ModeStatus_Failed;
    }
    else
    {
      status = CAN_ModeStatus_Success;
    }
  }
  else if (CAN_OperatingMode == CAN_OperatingMode_Sleep)
  {
    CANx->CTLR = (uint32_t)((CANx->CTLR & (uint32_t)(~(uint32_t)CAN_CTLR_INRQ)) | CAN_CTLR_SLEEP);

    while (((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_SLAK) && (timeout!=0))
    {
      timeout--;
    }
    if ((CANx->STATR & CAN_MODE_MASK) != CAN_STATR_SLAK)
    {
      status = CAN_ModeStatus_Failed;
    }
    else
    {
      status = CAN_ModeStatus_Success;
    }
  }
  else
  {
    status = CAN_ModeStatus_Failed;
  }

  return  (uint8_t) status;
}

/*******************************************************************************
* Function Name  : CAN_Sleep
* Description    : Enters the low power mode.
* Input          : CANx: where x can be 1 to select the CAN peripheral.
* Return         : sleepstatus: 
*                    CAN_Sleep_Ok.
*                    CAN_Sleep_Failed.
*******************************************************************************/
uint8_t CAN_Sleep(CAN_TypeDef* CANx)
{
  uint8_t sleepstatus = CAN_Sleep_Failed;

  CANx->CTLR = (((CANx->CTLR) & (uint32_t)(~(uint32_t)CAN_CTLR_INRQ)) | CAN_CTLR_SLEEP);
   
  if ((CANx->STATR & (CAN_STATR_SLAK|CAN_STATR_INAK)) == CAN_STATR_SLAK)
  {
    sleepstatus =  CAN_Sleep_Ok;
  }
	
  return (uint8_t)sleepstatus;
}

/*******************************************************************************
* Function Name  : CAN_WakeUp
* Description    : Wakes the CAN up.
* Input          : CANx: where x can be 1 to select the CAN peripheral.
* Return         : wakeupstatus: 
*                    CAN_WakeUp_Ok.
*                    CAN_WakeUp_Failed.
*******************************************************************************/
uint8_t CAN_WakeUp(CAN_TypeDef* CANx)
{
  uint32_t wait_slak = SLAK_TIMEOUT;
  uint8_t wakeupstatus = CAN_WakeUp_Failed;
    
  CANx->CTLR &= ~(uint32_t)CAN_CTLR_SLEEP;
    
  while(((CANx->STATR & CAN_STATR_SLAK) == CAN_STATR_SLAK)&&(wait_slak!=0x00))
  {
   wait_slak--;
  }
  if((CANx->STATR & CAN_STATR_SLAK) != CAN_STATR_SLAK)
  {
    wakeupstatus = CAN_WakeUp_Ok;
  }

  return (uint8_t)wakeupstatus;
}

/*******************************************************************************
* Function Name  : CAN_GetLastErrorCode
* Description    : Returns the CANx's last error code (LEC).
* Input          : CANx: where x can be 1 to select the CAN peripheral.   
* Return         : errorcode: specifies the Error code.  
*                    CAN_ErrorCode_NoErr: No Error.
*                    CAN_ErrorCode_StuffErr: Stuff Error.
*                    CAN_ErrorCode_FormErr: Form Error.
*                    CAN_ErrorCode_ACKErr: Acknowledgment Error.
*                    CAN_ErrorCode_BitRecessiveErr: Bit Recessive Error.
*                    CAN_ErrorCode_BitDominantErr: Bit Dominant Error.
*                    CAN_ErrorCode_CRCErr: CRC Error.
*                    CAN_ErrorCode_SoftwareSetErr: Software Set Error.
*******************************************************************************/ 
uint8_t CAN_GetLastErrorCode(CAN_TypeDef* CANx)
{
  uint8_t errorcode=0;
  
  errorcode = (((uint8_t)CANx->ERRSR) & (uint8_t)CAN_ERRSR_LEC);
  
  return errorcode;
}

/*******************************************************************************
* Function Name  : CAN_GetReceiveErrorCounter
* Description    : Returns the CANx Receive Error Counter (REC).
* Input          : CANx: where x can be 1 to select the CAN peripheral.   
* Return         : counter: CAN Receive Error Counter.  
*******************************************************************************/ 
uint8_t CAN_GetReceiveErrorCounter(CAN_TypeDef* CANx)
{
  uint8_t counter=0;
   
  counter = (uint8_t)((CANx->ERRSR & CAN_ERRSR_REC)>> 24);
  
  return counter;
}

/*******************************************************************************
* Function Name  : CAN_GetLSBTransmitErrorCounter
* Description    : Returns the LSB of the 9-bit CANx Transmit Error Counter(TEC).
* Input          : CANx: where x can be 1 to select the CAN peripheral.   
* Return         : counter: LSB of the 9-bit CAN Transmit Error Counter.  
*******************************************************************************/ 
uint8_t CAN_GetLSBTransmitErrorCounter(CAN_TypeDef* CANx)
{
  uint8_t counter=0;
  
  counter = (uint8_t)((CANx->ERRSR & CAN_ERRSR_TEC)>> 16);
  
