RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_can.c
      case CAN_IT_FF0:
        itstatus = CheckITStatus(CANx->RFIFO0, CAN_RFIFO0_FULL0);  
	      break;
			
      case CAN_IT_FOV0:
        itstatus = CheckITStatus(CANx->RFIFO0, CAN_RFIFO0_FOVR0);  
	      break;
			
      case CAN_IT_FMP1:
        itstatus = CheckITStatus(CANx->RFIFO1, CAN_RFIFO1_FMP1);  
	      break;
			
      case CAN_IT_FF1:
	      itstatus = CheckITStatus(CANx->RFIFO1, CAN_RFIFO1_FULL1);  
	      break;
			
      case CAN_IT_FOV1:
	      itstatus = CheckITStatus(CANx->RFIFO1, CAN_RFIFO1_FOVR1);  
	      break;
			
      case CAN_IT_WKU:
        itstatus = CheckITStatus(CANx->STATR, CAN_STATR_WKUI);  
	      break;
			
      case CAN_IT_SLK:
	      itstatus = CheckITStatus(CANx->STATR, CAN_STATR_SLAKI);  
	      break;
			
      case CAN_IT_EWG:
	      itstatus = CheckITStatus(CANx->ERRSR, CAN_ERRSR_EWGF);  
	      break;
			
      case CAN_IT_EPV:
	      itstatus = CheckITStatus(CANx->ERRSR, CAN_ERRSR_EPVF);  
	      break;
			
      case CAN_IT_BOF:
	      itstatus = CheckITStatus(CANx->ERRSR, CAN_ERRSR_BOFF);  
	      break;
			
      case CAN_IT_LEC:
	      itstatus = CheckITStatus(CANx->ERRSR, CAN_ERRSR_LEC);  
	      break;
			
      case CAN_IT_ERR:
        itstatus = CheckITStatus(CANx->STATR, CAN_STATR_ERRI); 
	      break;
			
      default :
        itstatus = RESET;
        break;
    }
	}
  else
  {
    itstatus  = RESET;
  }
  
  return  itstatus;
}

/*******************************************************************************
* Function Name  : CAN_ClearITPendingBit
* Description    : Clears the CANx's interrupt pending bits.
* Input          : CANx: where x can be 1 to select the CAN peripheral.
*                  CAN_IT: specifies the interrupt pending bit to clear.
*                    CAN_IT_TME.                     
*                    CAN_IT_FF0.               
*                    CAN_IT_FOV0.                     
*                    CAN_IT_FF1.               
*                    CAN_IT_FOV1.              
*                    CAN_IT_WKU.  
*                    CAN_IT_SLK.  
*                    CAN_IT_EWG.    
*                    CAN_IT_EPV.    
*                    CAN_IT_BOF.    
*                    CAN_IT_LEC.    
*                    CAN_IT_ERR.   
* Return         :  None
*******************************************************************************/
void CAN_ClearITPendingBit(CAN_TypeDef* CANx, uint32_t CAN_IT)
{
	switch (CAN_IT)
	{
		case CAN_IT_TME:
			CANx->TSTATR = CAN_TSTATR_RQCP0|CAN_TSTATR_RQCP1|CAN_TSTATR_RQCP2;  
			break;

		case CAN_IT_FF0:
			CANx->RFIFO0 = CAN_RFIFO0_FULL0; 
			break;

		case CAN_IT_FOV0:
			CANx->RFIFO0 = CAN_RFIFO0_FOVR0; 
			break;

		case CAN_IT_FF1:
			CANx->RFIFO1 = CAN_RFIFO1_FULL1;  
			break;

		case CAN_IT_FOV1:
			CANx->RFIFO1 = CAN_RFIFO1_FOVR1; 
			break;

		case CAN_IT_WKU:
			CANx->STATR = CAN_STATR_WKUI;  
			break;

		case CAN_IT_SLK:
			CANx->STATR = CAN_STATR_SLAKI;   
			break;

		case CAN_IT_EWG:
			CANx->STATR = CAN_STATR_ERRI;
			break;

		case CAN_IT_EPV:
			CANx->STATR = CAN_STATR_ERRI; 
			break;

		case CAN_IT_BOF:
			CANx->STATR = CAN_STATR_ERRI; 
			break;

		case CAN_IT_LEC:
			CANx->ERRSR = RESET; 
			CANx->STATR = CAN_STATR_ERRI; 
			break;

		case CAN_IT_ERR:
			CANx->ERRSR = RESET; 
			CANx->STATR = CAN_STATR_ERRI; 
			break;

		default :
			break;
	}
}

/*******************************************************************************
* Function Name  : CheckITStatus
* Description    : Checks whether the CAN interrupt has occurred or not.
* Input          : CAN_Reg: specifies the CAN interrupt register to check
*                  It_Bit:  specifies the interrupt source bit to check.    
* Return         : ITStatus: SET or RESET.
*******************************************************************************/
static ITStatus CheckITStatus(uint32_t CAN_Reg, uint32_t It_Bit)
{
  ITStatus pendingbitstatus = RESET;
  
  if ((CAN_Reg & It_Bit) != (uint32_t)RESET)
  {
    pendingbitstatus = SET;
  }
  else
  {
    pendingbitstatus = RESET;
  }
	
  return pendingbitstatus;
}






